# Напишите программу, в которой пользователь будет задавать две строки, 
# а программа - определять количество вхождений одной строки в другой

a = input('Введите 1 строку: ')
b = input('Введите 2 строку: ')
n = a.count(b)
print(n)