# Задайте число. Составьте список чисел Фибоначчи, в том числе для 
# отрицательных индексов.
# Пример:
# для k = 8 список будет выглядеть так: 
# [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21] [Негафибоначчи]

k = int(input('Введите число: '))
nf = [1, -1]
f = [1, 1]
for i in range(2, k):
    list = f[i-1] + f[i-2]
    f.append(list)
    list2 = nf[i-2] - nf[i-1]
    nf.append(list2)
nf.reverse()
f.insert(0, 0)
print(nf+f)