# Task 1
# Напишите программу, которая принимает на вход числ и проверяет, 
# является ли оно четным.

x = int(input('Введите число: '))
if x%2==0:
    print('четное')
else:
    print('не четное')
